export default {
	name: 'calendar',
	data () {
		return {
			msg: 'ตารางสอนขับรถ',
			train_detail: [],
			select_type: [{id: 1, text: 'วันนี้'}, {id: 2, text: '7 วัน'}, {id: 3, text: 'เดือนนี้'}],
			selectType: 1
		}
	},
	methods: {
		getDetail () {	
			switch (this.selectType) {
				case 1 : this.train_detail = [{
												no: 1,
												date: 'Monday, 12 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  }]
						break
				case 2 : this.train_detail = [{
												no: 1,
												date: 'Monday, 12 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 2,
												date: 'Monday, 14 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 3,
												date: 'Monday, 16 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  }
											  ]
						break
				case 3 : this.train_detail = [{
												no: 1,
												date: 'Monday, 12 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 2,
												date: 'Monday, 14 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 3,
												date: 'Monday, 16 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 4,
												date: 'Monday, 18 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 5,
												date: 'Monday, 19 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 6,
												date: 'Monday, 21 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 7,
												date: 'Monday, 26 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 8,
												date: 'Monday, 29 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 9,
												date: 'Monday, 30 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  },{
												no: 10,
												date: 'Monday, 31 Aus 2016 | 10:00 - 12:00 AM',
												teacher: 'Teacher. ฤกษณะ  ขับเร็ว',
												student: 'คุณ มาแรง  แซงเรียบ',
												location: 'ลัดดาแลน ถ.โชตนาเชียงใหม่ - ฝาง อ.แม่ริม จ.เชียงใหม่',
												car: 'ยี่ห้อ : Demax, ทะเบียน : กกน 56123, เกียร์ : ธรรมดา'
											  }
											  ]
						break
			}
		}
	},
	mounted () {
		this.getDetail()
	}
}